jaliquiel/BlackJack_MSP430/main.c
                // put card on deck
                deck[deckIndex] = i;
            }

            // Give 2 cards to player and cpu from deck
            strcpy(playerHand[0], getCardString(deck[topDeckIndex]));
            topDeckIndex++;
            strcpy(playerHand[1], getCardString(deck[topDeckIndex]));
            topDeckIndex++;
            playerCards += 2;

            strcpy(cpuHand[0], getCardString(deck[topDeckIndex]));
            topDeckIndex++;
            strcpy(cpuHand[1], getCardString(deck[topDeckIndex]));
            topDeckIndex++;
            cpuCards += 2;

            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
                if (i == 1){
                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
                    continue;
                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);

            // get ready to switch state to bet
            state = bet;
            swDelay(1);
            setLeds(0);
            break;

        case bet: // Adding cards state

            // Write some text to the display
            Graphics_drawStringCentered(&g_sContext, "Bet:1-2-4-8", AUTO_STRING_LENGTH, 40, 60, TRANSPARENT_TEXT);
            // Refresh the display so it shows the new data
            Graphics_flushBuffer(&g_sContext);

            // wait until player puts a bet 1, 2, 4, 8
            while(1){
                currKey = getKey();
                if((currKey == '1') || (currKey == '2') || (currKey == '4') || (currKey == '8'))
                    break;
            }


            Graphics_clearDisplay(&g_sContext); // Clear the display

            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
                if (i == 1){
                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
                    continue;
                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }

            // store the bet of the player
            playerBet = currKey;
            dispThree[0] = ' ';
            dispThree[1] = playerBet;
            dispThree[2] = '\0';

            // display players's bet
            Graphics_drawStringCentered(&g_sContext, "Your bet is: ", AUTO_STRING_LENGTH, 45, 60, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, dispThree, AUTO_STRING_LENGTH, 80, 60, TRANSPARENT_TEXT);
            Graphics_flushBuffer(&g_sContext);

            // light up LDE based on bet
            setLeds(playerBet - 0x30);

            // calculate and display cpu's bet
            cpuBet = calculateBet(getValue(&cpuHand, cpuHandLen) , playerBet);
            dispThree[0] = ' ';
            dispThree[1] = cpuBet;
            dispThree[2] = '\0';
            Graphics_drawStringCentered(&g_sContext, "CPU's bet is: ", AUTO_STRING_LENGTH, 50, 75, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, dispThree, AUTO_STRING_LENGTH, 90, 75, TRANSPARENT_TEXT);
            Graphics_flushBuffer(&g_sContext);


            // if playerBet is not equal to cpu bet then player needs to put difference
            if (playerBet != cpuBet){
                int difference;
                while(currKey != '*'){
                    currKey = getKey();
                    difference = playerBet + currKey - ('0'*2);
                    if(difference == cpuBet - '0'){
                        setLeds(difference - 0x30);
                        break;
                    }

