jaliquiel/BlackJack_MSP430/main.c
                }
            }
            if(currKey == '*'){
                // go to reset state
                state = reset;
            }else{
                playerBet = cpuBet;
                state = draw;
                Graphics_clearDisplay(&g_sContext); // Clear the display
            }
            swDelay(1);
            break;

        case draw: // Player's Turn
            endGame = isOverflow(getValue(&playerHand, playerHandLen));

            if(endGame == lost){
                state = loser;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else if(endGame == won){
                state = winner;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }


            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
                if (i == 1){
                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
                    continue;
                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_drawStringCentered(&g_sContext, "Press 1 to draw", AUTO_STRING_LENGTH, 48, 70, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "Press # to hold", AUTO_STRING_LENGTH, 48, 80, TRANSPARENT_TEXT);
            Graphics_flushBuffer(&g_sContext);

            // ask player to fold or get a card
            while(1){
                currKey = getKey();
                if((currKey == '#') || (currKey == '1') )
                    break;
            }


            if (currKey == '1'){
                // add card to player
                strcpy(playerHand[playerCards], getCardString(deck[topDeckIndex]));
                topDeckIndex++;
                playerCards += 1;

                state = draw;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display

                // get out of switch statement
                break;
            }else if(currKey == '#'){
                state = cpu;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }

            break;

        case cpu: // Win or lost state
            // display celebration or loss statement


            cpuHandValue = getValue(&cpuHand, cpuHandLen);
            endGame = isOverflow(cpuHandValue);

            // CPU lost, so send player to win screen
            if(endGame == lost){
                state = winner;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else if(endGame == won){
                // CPU won so send player to lost screen
                state = loser;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }

            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
                if (i == 1){
                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
                    continue;
                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);


