jaliquiel/BlackJack_MSP430/main.c
//            // Do CPU Action
//            // restart state
            if(cpuDraw(cpuHandValue)){
                // draw and reenter state
                // add card to player
                strcpy(cpuHand[cpuCards], getCardString(deck[topDeckIndex]));
                topDeckIndex++;
                cpuCards += 1;

                state = cpu;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                // get out of switch statement
                break;

            }else{
                // go to final game decision state
                state = end;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;

            }

            break;

        case loser: // Lost state
            // display celebration or loss statement
            // ...


            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }

            dispThree[0] = ' ';
            dispThree[1] = cpuBet;
            dispThree[2] = '\0';
            for(i = 0; i < 4; i ++){
                Graphics_drawStringCentered(&g_sContext, "YOU LOST", AUTO_STRING_LENGTH, 28, 60 + i*10, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, dispThree , AUTO_STRING_LENGTH, 54, 60 + i*10, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "CHIPS" , AUTO_STRING_LENGTH, 78, 60 + i*10, TRANSPARENT_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);

            humiliation();

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // Go to reset state
                state = reset;
            }

            break;

        case winner: // Win state


            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }


            // display celebration
            dispThree[0] = ' ';
            dispThree[1] = cpuBet;
            dispThree[2] = '\0';
            for(i = 0; i < 4; i ++){
                Graphics_drawStringCentered(&g_sContext, "YOU WON", AUTO_STRING_LENGTH, 28, 60 + i*10, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, dispThree , AUTO_STRING_LENGTH, 54, 60 + i*10, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "CHIPS" , AUTO_STRING_LENGTH, 78, 60 + i*10, TRANSPARENT_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);

            //proper celebration w/ buzzer and leds
            celebration();

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // Go to reset state
                state = reset;
            }
            break;

        case end: // cpu and player holded, decide winner

            // PRINT OUT PLAYERS HANDS
            Graphics_drawStringCentered(&g_sContext, "PLAYER 1:", AUTO_STRING_LENGTH, 48, 10, TRANSPARENT_TEXT);
            // print out player's cards
            playerHandLen = sizeof(playerHand)/sizeof(playerHand[0]);
            for (i = 0; i< playerHandLen;i++){
                if(playerHand[i][0] == '\0'){
                    break;
                }
//                else if(playerHand[i][0] == '1'){
//                    Graphics_drawStringCentered(&g_sContext, "10", AUTO_STRING_LENGTH, 17 + i*25, 20, OPAQUE_TEXT);
//                    Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
//                    continue;
//                }
                Graphics_drawStringCentered(&g_sContext, playerHand[i], dispSz, 10 + i*25, 20, OPAQUE_TEXT);
            }
            // print out cpu's cards
            cpuHandLen = sizeof(cpuHand)/sizeof(cpuHand[0]);
            Graphics_drawStringCentered(&g_sContext, "CPU", AUTO_STRING_LENGTH, 48, 40, TRANSPARENT_TEXT);
            for (i = 0; i< cpuHandLen;i++){
                if(cpuHand[i][0] == '\0'){
                    break;
                }
//                if (i == 1){
//                    Graphics_drawStringCentered(&g_sContext, "xxx", dispSz, 10 + i*25, 50, OPAQUE_TEXT);
//                    continue;
//                }
                // TODO FIX PRINTING OF 10s ******************************************************************************************************10
                Graphics_drawStringCentered(&g_sContext, cpuHand[i], dispSz, 10 + i*25, 50, OPAQUE_TEXT);
            }
            Graphics_flushBuffer(&g_sContext);


            // calculate hand values for player and cpu
            cpuHandValue = getValue(&cpuHand, cpuHandLen);
            playerHandValue = getValue(&playerHand, playerHandLen);
            // closest hand to 21 wins
            // In this case, none of the hands are above 21 therefore, the biggest value is the closest to 21
            if (playerHandValue > cpuHandValue){
                // go to win state
                state = winner;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else if (playerHandValue < cpuHandValue){
                // go to lose state
                state = loser;
                currKey = NULL;
                Graphics_clearDisplay(&g_sContext); // Clear the display
                break;
            }else{
                // draw
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 60, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 70, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 80, TRANSPARENT_TEXT);
                Graphics_drawStringCentered(&g_sContext, "DRAW", AUTO_STRING_LENGTH, 48, 90, TRANSPARENT_TEXT);
            }

            while(currKey != '*'){
                currKey = getKey();
            }

            if(currKey == '*'){
                // Go to reset state
                state = reset;
            }
            break;

        case reset: // reset state
            // RESTART ALL VARIABLES FOR NEW GAME
            Graphics_clearDisplay(&g_sContext); // Clear the display
            state = welcome;
            currKey = NULL;
            dispThree[0] = NULL;
            dispThree[1] = NULL;
            dispThree[2] = NULL;
            for(i = 0; i < 52; i ++ ){
                deck[i] = 0;
            }
            topDeckIndex = 0; // represents the current index of the top of the deck
            playerCards = 0;
            cpuCards = 0;
            int j;
            for(i = 0; i < 10; i ++ ){
                for(j = 0; j < 10; j++){
                    playerHand[i][j] = 0;
                    cpuHand[i][j] = 0;
                }
            }
            state = welcome;
            break;
        } // end switch statement

